_wiki/2015-08-07-networking-tips.html
---
collections: wiki
layout: post
title: Networking Tips
date: 2015-08-07
categories: 
-
tags: 
- networking
- storage
author: carltonf
excerpt: including remote storage
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Samba</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Mount <code>cifs</code></h3>
<div class="outline-text-3" id="text-1-1">
<pre class="example">
mount -t cifs //10.0.0.2/winxp /mnt/smb -o user=icesnow,password=thisisyourpasswd
</pre>

<p>
To mandate the <code>uid</code> and <code>gid</code> for the mounted samba files, use <code>gid/uid</code> and
<code>forcegid/forceuid</code> options.
</p>

<ul class="org-ul">
<li>Example

<pre class="example">
mount -t cifs //git.tp-link.net/jobs jenkins/ -o user="xiongchao%betheman" -o uid=xiongchao -o gid=xiongchao -o forceuid -o forcegid
</pre>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><code>smbmount</code></h3>
<div class="outline-text-3" id="text-1-2">
<p>
<b>DEPRECATED</b>, use the <code>cifs</code> instead
</p>

<ul class="org-ul">
<li>authentication
<pre class="example">
smbmount //172.31.130.64/mobile/项目/GA/Qualcomm /mnt/tmp -o user="xiongchao%tplink"
</pre>
</li>
<li>guest
<pre class="example">
smbmount //lyd-pc/ubuntu /mnt/lyd/ -o guest
</pre>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">The Stream Nature of TCP</h2>
<div class="outline-text-2" id="text-2">
<p>
User protocol over TCP needs to deal with packet boundary <b>itself</b> The <b>stream
nature</b> of TCP makes no guarantee towards whether a packet is splited or not.
</p>
</div>
</div>
